---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.ThumbnailFile
source: html/8eab2a3d-8282-95e6-a012-19d652ebe8eb.htm
---
# Autodesk.Revit.DB.MaterialNode.ThumbnailFile Property

The path if a file that contains a thumbnail image of the material.

## Syntax (C#)
```csharp
public string ThumbnailFile { get; }
```